In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# Loading the data
file_path = "../Resources/shopping_data.csv"
shopping_df = pd.read_csv(file_path, encoding= "ISO-8859-1")
shopping_df.head(5)

   CustomerID Card Member   Age  Annual Income  Spending Score (1-100)
0           1         Yes  19.0          15000                    39.0
1           2         Yes  21.0          15000                    81.0
2           3          No  20.0          16000                     6.0
3           4          No  23.0          16000                    77.0
4           5          No  31.0          17000                    40.0

In [3]:
# Look at the columns
shopping_df.columns

Index(['CustomerID', 'Card Member', 'Age', 'Annual Income',
       'Spending Score (1-100)'],
      dtype='object')

In [4]:
# List the dataframe types
shopping_df.dtypes

CustomerID                  int64
Card Member                object
Age                       float64
Annual Income               int64
Spending Score (1-100)    float64
dtype: object

In [5]:
# Shape of the df
shopping_df.shape

(203, 5)

In [6]:
# Find the null values
for col in shopping_df.columns:
    print(f'Column {col} has {shopping_df[col].isnull().sum()} null values')

Column CustomerID has 0 null values
Column Card Member has 2 null values
Column Age has 2 null values
Column Annual Income has 0 null values
Column Spending Score (1-100) has 1 null values

In [7]:
# Drop the null values
shopping_df = shopping_df.dropna()

In [8]:
# Find duplicates
shopping_df.duplicated().sum()

0

In [9]:
# Drop the CustomerID column
shopping_df.drop(columns=['CustomerID'], inplace=True)
shopping_df.head()

  Card Member   Age  Annual Income  Spending Score (1-100)
0         Yes  19.0          15000                    39.0
1         Yes  21.0          15000                    81.0
2          No  20.0          16000                     6.0
3          No  23.0          16000                    77.0
4          No  31.0          17000                    40.0

In [10]:
# Transform the string values to numeric values
def changeString(member):
    if member == 'Yes':
        return 1
    else:
        return 0

shopping_df['Card Member'] = shopping_df['Card Member'].apply(changeString)
shopping_df.head()

   Card Member   Age  Annual Income  Spending Score (1-100)
0            1  19.0          15000                    39.0
1            1  21.0          15000                    81.0
2            0  20.0          16000                     6.0
3            0  23.0          16000                    77.0
4            0  31.0          17000                    40.0

In [11]:
# Rename Columns to get rid of spaces and numbers
shopping_df.rename(columns={'Card Member':'CardMember', 'Annual Income' : 'AnnualIncome', 'Spending Score (1-100)':'SpendingScore' }, inplace=True)
shopping_df.head()

   CardMember   Age  AnnualIncome  SpendingScore
0           1  19.0         15000           39.0
1           1  21.0         15000           81.0
2           0  20.0         16000            6.0
3           0  23.0         16000           77.0
4           0  31.0         17000           40.0

In [12]:
# Convert the floats into ints
shopping_df = shopping_df.astype({'Age': 'int64', 'SpendingScore': 'int64'})
shopping_df.head()

   CardMember  Age  AnnualIncome  SpendingScore
0           1   19         15000             39
1           1   21         15000             81
2           0   20         16000              6
3           0   23         16000             77
4           0   31         17000             40

In [13]:
# Divide AnnualIncome by 1000 to get the income in thousands
shopping_df['AnnualIncome'] = shopping_df['AnnualIncome'] / 1000
shopping_df

     CardMember  Age  AnnualIncome  SpendingScore
0             1   19          15.0             39
1             1   21          15.0             81
2             0   20          16.0              6
3             0   23          16.0             77
4             0   31          17.0             40
..          ...  ...           ...            ...
198           0   35         120.0             79
199           0   45         126.0             28
200           1   32         126.0             74
201           1   32         137.0             18
202           1   30         137.0             83

[200 rows x 4 columns]

In [14]:
# Save the cleaned dataframe
shopping_df.to_csv('../Resources/shopping_data_cleaned.csv', index=False)

In [16]:
# Save the cleaned dataframe into excel
shopping_df.to_excel('../Resources/shopping_data_cleaned.xlsx', index=False)